# Pandas


Pandas is the most popular python library used for data science and with good reason: it offers powerful, expressive and flexible data structures that make data manipulation and analysis easy.

What’s cool about Pandas is that it takes data (like a CSV or Excel or a SQL database) and creates a Python object with rows and columns called *dataframe* that looks very similar to table in a statistical software (think Excel).

As well as offering a convenient storage interface for labeled data, Pandas implements a number of powerful data operations familiar to users of both database frameworks and spreadsheet programs.

### Installation and getting started

To be able to use Pandas we need to import the library first. Importing a library means loading it into memory and then it's there for us to work with it.
To import Pandas all you have to do is run the following lines:

In [1]:
import pandas as pd 
#usually we add the second part 'as pd' so we can access it with 'pd.command' instead of 'pandas.command'

import numpy as np

### Pandas Data Structures

At the very basic level, Pandas objects can be thought of as enhanced versions of NumPy structured arrays in which the rows and columns are identified with labels rather than simple integer indices.

#### The Pandas Series Object

<br>
A one-dimensional labeled array capable of holding any data type(integer, string, float, python objects).The axis labels are collectively called *index*.

In [4]:
#creating a series from ndarray
data = np.array(['a','b','c','d'])
s = pd.Series(data)
print(s)

0    a
1    b
2    c
3    d
dtype: object

We did not pass any index, so by default, it assigned the indexes ranging from 0 to len(data)-1, i.e., 0 to 3.

In [5]:
#creating a series and passing the index values
data = np.array(['a','b','c','d'])
s = pd.Series(data,index=[100,101,102,103])
print(s)

100    a
101    b
102    c
103    d
dtype: object

In [6]:
#creating a series from a dictionary
data = {'a' : 0., 'b' : 1., 'c' : 2.}
s = pd.Series(data)
print(s)

a    0.0
b    1.0
c    2.0
dtype: float64

**Observe** − Dictionary keys are used to construct index.

In [8]:
s = pd.Series([3, -5, 7, 4],  index=['a',  'b',  'c',  'd'])
print(s)

a    3
b   -5
c    7
d    4
dtype: int64

### Accessing Data from Series with Position
Data in the series can be accessed similar to that in an ndarray.

In [10]:
#retrieve the first element
s = pd.Series([1,2,3,4,5],index = ['a','b','c','d','e'])
print(s[0])

1

In [11]:
#retrieve the first 3 elements
print(s[:3])

a    1
b    2
c    3
dtype: int64

### Retrieve Data Using Label (Index)
A Series is like a fixed-size dict in that you can get and set values by index label.

In [14]:
s = pd.Series([1,2,3,4,5],index = ['a','b','c','d','e'])

#retrieve a single element
print(s['a'])

1

In [16]:
#retrieve multiple elements using a list of index label values
print(s[['a','c','d']])

a    1
c    3
d    4
dtype: int64

### The Pandas Series DataFrame object <br>
A two-dimensional labeled data structure with columns of potentially different types. <br>
In general, you could say that the Pandas DataFrame consists of three main components: the data, the index, and the columns.

A DataFrame can contain data that is:
- a Pandas `DataFrame`
- a Pandas `Series`
- a NumPy `ndarray`
- dictionaries of one-dimensional `ndarray`’s, lists, dictionaries or Series.

Note the difference between `np.ndarray` and `np.array()`.The former is an actual data type, while the latter is a function to make arrays from other data structures.

In [19]:
#create a dataframe from lists
data = [['Alex',10],['Bob',12],['Clarke',13]]
df = pd.DataFrame(data,columns=['Name','Age'])
df

     Name  Age
0    Alex   10
1     Bob   12
2  Clarke   13

In [21]:
#create dataframe from dictionary of lists/ndarrays
#all the arrays mut be of the same length
data = {'Country': ['Belgium',  'India',  'Brazil'],

        'Capital': ['Brussels',  'New Delhi',  'Brasilia'],

        'Population': [11190846, 1303171035, 207847528]}

df = pd.DataFrame(data, columns=['Country',  'Capital',  'Population'])
df

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasilia   207847528

In [22]:
#create a dataframe from a dictionary and pass an index
data = {'Name':['Tom', 'Jack', 'Steve', 'Ricky'],'Age':[28,34,29,42]}
df = pd.DataFrame(data, index=['rank1','rank2','rank3','rank4'])
df

        Name  Age
rank1    Tom   28
rank2   Jack   34
rank3  Steve   29
rank4  Ricky   42

### Loading and Saving Data with Pandas

Usually, when we use pandas for data analysis, we’ll use it in one of three different ways:
- Convert a Python’s list, dictionary or Numpy array to a Pandas data frame
- Open a local file using Pandas, usually a CSV or Excel file
- Open a remote file or database like a CSV or a JSONon a website through a URL or read from a SQL table/database

**Read and Write to CSV**

In [23]:
#write to csv file
df.to_csv('csv_example.csv')

#read from csv file
df_csv = pd.read_csv('csv_example.csv')
df_csv

  Unnamed: 0   Name  Age
0      rank1    Tom   28
1      rank2   Jack   34
2      rank3  Steve   29
3      rank4  Ricky   42

Well, we can see that the index is generated twice, the first one is loaded from the CSV file, while the second one, i.e `Unnamed` is generated automatically by Pandas while loading the CSV file.

This problem can be avoided by making sure that the writing of CSV files doesn’t write indexes, because `DataFrame` will generate it anyway. We can do the same by specifying `index = False` parameter in `to_csv(...)` function.

In [25]:
#write
df.to_csv('csv_example.csv', index=False)

#read
df_csv = pd.read_csv('csv_example.csv')
df_csv

    Name  Age
0    Tom   28
1   Jack   34
2  Steve   29
3  Ricky   42

**Read and Write to Excel**

In [26]:
#write to excel
df.to_excel('excel-example.xlsx', index=False, sheet_name='Sheet1')

#read from excel
df_excel = pd.read_excel('excel-example.xlsx')
df_excel

    Name  Age
0    Tom   28
1   Jack   34
2  Steve   29
3  Ricky   42

### Selection of Data

In [28]:
data = {'Country': ['Belgium',  'India',  'Brazil'],

        'Capital': ['Brussels',  'New Delhi',  'Brasilia'],

        'Population': [11190846, 1303171035, 207847528]}

df = pd.DataFrame(data, columns=['Country',  'Capital',  'Population'])

In [34]:
#get subset of a DataFrame
df[1:] #starting from row with index 1 and all columns

  Country    Capital  Population
1   India  New Delhi  1303171035
2  Brazil   Brasilia   207847528

In [35]:
#select the first row 
df.iloc[0]

Country        Belgium
Capital       Brussels
Population    11190846
Name: 0, dtype: object

By Position <br>

In [14]:
# Select single value by row and and column
#first element of the first column
df.iloc[[0],[0]]

   Country
0  Belgium

In [15]:
#Select multiple values by row and and column
df.iloc[1:3,[1]] #rows 1 and 2 and just column with index 1-> Capital

     Capital
1  New Delhi
2   Brasilia

In [16]:
df.iloc[[0,2],[1]] #rows with index 0 and 2 and column indexd at 1-> Capital

    Capital
0  Brussels
2  Brasilia

By Label

In [13]:
#Select single value by row and column labels
df.loc[1, 'Country']

'India'

In [14]:
#Select multiple values by row and column labels
df.loc[0:1,['Capital', 'Country']]

     Capital  Country
0   Brussels  Belgium
1  New Delhi    India

### Filter, Sort and Groupby

In [36]:
#You can use different conditions to filter columns
df[df['Population']<12000000]

   Country   Capital  Population
0  Belgium  Brussels    11190846

In [37]:
#sort values in a column in ascending order using df.sort_values(col1)
df.sort_values('Country')

   Country    Capital  Population
0  Belgium   Brussels    11190846
2   Brazil   Brasilia   207847528
1    India  New Delhi  1303171035

In [38]:
#or in dscending order
df.sort_values('Country', ascending=False)

   Country    Capital  Population
1    India  New Delhi  1303171035
2   Brazil   Brasilia   207847528
0  Belgium   Brussels    11190846

In [39]:
#also possible to sort ascending by one column and descending by another one
df.sort_values(['Country','Population'],ascending=[True,False])

   Country    Capital  Population
0  Belgium   Brussels    11190846
2   Brazil   Brasilia   207847528
1    India  New Delhi  1303171035

### Viewing and Inspecting Data
**Basic information**

In [44]:
#get the first 2 rows
df.head(2)

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035

In [45]:
#get the last 2 rows
df.tail(2)

  Country    Capital  Population
1   India  New Delhi  1303171035
2  Brazil   Brasilia   207847528

In [46]:
#get the nr of rows and columns
print(df.shape)

#describe the columns
print(df.columns)

#get the index, datatype and memory information
df.info()

#Number of non-NA values
df.count()

(3, 3)
Index(['Country', 'Capital', 'Population'], dtype='object')
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
Country       3 non-null object
Capital       3 non-null object
Population    3 non-null int64
dtypes: int64(1), object(2)
memory usage: 152.0+ bytes

Country       3
Capital       3
Population    3
dtype: int64

In [52]:
#returns the actual data in the dataframe as an ndarray
df.values

array([['Belgium', 'Brussels', 11190846],
       ['India', 'New Delhi', 1303171035],
       ['Brazil', 'Brasilia', 207847528]], dtype=object)

**Summary information**
<br>
To get statistics on the entire dataframe or a series we can use: 
- `df.mean()` Returns the mean of all columns
- `df.corr()` Returns the correlation between columns in a data frame
-  `df.count()` Returns the number of non-null values in each data frame column
-  `df.max()` Returns the highest value in each column
-  `df.min()` Returns the lowest value in each column
-  `df.median()` Returns the median of each column
- `df.std()` Returns the standard deviation of each column

In [59]:
#creating a dataframe to try our some functions
data = {'Name':pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack',
   'Lee','David','Gasper','Betina','Andres']),
   'Age':pd.Series([25,26,25,23,30,29,23,34,40,30,51,46]),
   'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.78,2.98,4.80,4.10,3.65])
}
df = pd.DataFrame(data)
df

      Name  Age  Rating
0      Tom   25    4.23
1    James   26    3.24
2    Ricky   25    3.98
3      Vin   23    2.56
4    Steve   30    3.20
5    Smith   29    4.60
6     Jack   23    3.78
7      Lee   34    2.98
8    David   40    4.80
9   Gasper   30    4.10
10  Betina   51    3.65
11  Andres   46     NaN

In [60]:
df.sum()

Name      TomJamesRickyVinSteveSmithJackLeeDavidGasperBe...
Age                                                     382
Rating                                                41.12
dtype: object

In [61]:
df.corr()

             Age    Rating
Age     1.000000  0.189616
Rating  0.189616  1.000000

In [62]:
df.dropna()

      Name  Age  Rating
0      Tom   25    4.23
1    James   26    3.24
2    Ricky   25    3.98
3      Vin   23    2.56
4    Steve   30    3.20
5    Smith   29    4.60
6     Jack   23    3.78
7      Lee   34    2.98
8    David   40    4.80
9   Gasper   30    4.10
10  Betina   51    3.65

In [64]:
df.max()

Name      Vin
Age        51
Rating    4.8
dtype: object

###  Data Cleaning

Data cleaning is a very important step in data analysis.
- `df.isnull()` checks for null values and returns a boolean array
- `df.notnull()` is the opposit of `df.isnull()`, returns boolean array too
- `df.dropna()` drops rows with empty values
- `df.dropna(axis=1)` drops columns with empty values
- `df.fillna(x)` which fills the missing values with x
- `df.replace(old,new)` replaces all old values with new one

In [70]:
df.isnull()

     Name    Age  Rating
0   False  False   False
1   False  False   False
2   False  False   False
3   False  False   False
4   False  False   False
5   False  False   False
6   False  False   False
7   False  False   False
8   False  False   False
9   False  False   False
10  False  False   False
11  False  False    True

In [71]:
df.notnull()

    Name   Age  Rating
0   True  True    True
1   True  True    True
2   True  True    True
3   True  True    True
4   True  True    True
5   True  True    True
6   True  True    True
7   True  True    True
8   True  True    True
9   True  True    True
10  True  True    True
11  True  True   False

In [73]:
df.dropna(axis=1)

      Name  Age
0      Tom   25
1    James   26
2    Ricky   25
3      Vin   23
4    Steve   30
5    Smith   29
6     Jack   23
7      Lee   34
8    David   40
9   Gasper   30
10  Betina   51
11  Andres   46

In [74]:
df.fillna(1.2)

      Name  Age  Rating
0      Tom   25    4.23
1    James   26    3.24
2    Ricky   25    3.98
3      Vin   23    2.56
4    Steve   30    3.20
5    Smith   29    4.60
6     Jack   23    3.78
7      Lee   34    2.98
8    David   40    4.80
9   Gasper   30    4.10
10  Betina   51    3.65
11  Andres   46    1.20

In [76]:
df.replace(25,555)

      Name  Age  Rating
0      Tom  555    4.23
1    James   26    3.24
2    Ricky  555    3.98
3      Vin   23    2.56
4    Steve   30    3.20
5    Smith   29    4.60
6     Jack   23    3.78
7      Lee   34    2.98
8    David   40    4.80
9   Gasper   30    4.10
10  Betina   51    3.65
11  Andres   46     NaN

### Join/Combine

The last set of basic Pandas commands are for joining or combining data frames or rows/columns. The three commands are:
- `df1.append(df2)` — add the rows in df1 to the end of df2 (columns should be identical)
- `pd.concat([df1, df2],axis=1)` — add the columns in df1 to the end of df2 (rows should be identical)
- `df1.merge(df2,on=col1,how='inner')` — SQL-style join the columns in df1 with the columns on df2 where the rows for `col` have identical values. `how` variable can be equal to one of: 'left', 'right', 'outer', 'inner'.

In [81]:
#creating first dataframe
data1 = {'Name':pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack',
   'Lee','David','Gasper','Betina','Andres']),
   'Age':pd.Series([25,26,25,23,30,29,23,34,40,30,51,46]),
   'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.78,2.98,4.80,4.10,3.65])
}
df1 = pd.DataFrame(data1)

#creating second dataframe
data2 = {'Name':pd.Series(['Andreea','Vlad','Carlo']),
   'Age':pd.Series([21,21,21]),
   'Rating':pd.Series([4.,5,4.6])
}
df2 = pd.DataFrame(data2)

#using append
df3 = df1.append(df2)
df3

       Name  Age  Rating
0       Tom   25    4.23
1     James   26    3.24
2     Ricky   25    3.98
3       Vin   23    2.56
4     Steve   30    3.20
5     Smith   29    4.60
6      Jack   23    3.78
7       Lee   34    2.98
8     David   40    4.80
9    Gasper   30    4.10
10   Betina   51    3.65
11   Andres   46     NaN
0   Andreea   21    4.00
1      Vlad   21    5.00
2     Carlo   21    4.60

In [87]:
#creating first dataframe
data1 = {'Name':pd.Series(['Tom','James','Ricky','Vin','Steve']),
   'Age':pd.Series([25,26,25,23,30]),
   'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20])
}
df1 = pd.DataFrame(data1)

#creating second dataframe
data2 = {'Ocupation':pd.Series(['Student','Professional','Student','Student',
                                'Professional'])
}
df2 = pd.DataFrame(data2)

#using concat
df3 = pd.concat([df1, df2],axis=1)
df3

    Name  Age  Rating     Ocupation
0    Tom   25    4.23       Student
1  James   26    3.24  Professional
2  Ricky   25    3.98       Student
3    Vin   23    2.56       Student
4  Steve   30    3.20  Professional

In [94]:
#creating first dataframe
data1 = {'Name':pd.Series(['Tom','James','Ricky','Vin','Steve']),
   'Age':pd.Series([25,26,25,23,30]),
   'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20])
}
df1 = pd.DataFrame(data1)

#creating second dataframe
data2 = {'Name':pd.Series(['Tom','James','Ricky','Vin','Steve']),
        'Ocupation':pd.Series(['Student','Professional','Student','Student',
                                'Professional'])
}
df2 = pd.DataFrame(data2)

#using merge
df3 = df1.merge(df2,on='Name',how='left') 
df3

    Name  Age  Rating     Ocupation
0    Tom   25    4.23       Student
1  James   26    3.24  Professional
2  Ricky   25    3.98       Student
3    Vin   23    2.56       Student
4  Steve   30    3.20  Professional